---
kind: type
id: T:Autodesk.Revit.DB.MultiReferenceAnnotationType
source: html/046b4d91-40b3-4dd0-be1b-635fb30956c2.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationType

The type for MultiReferenceAnnotation.

## Syntax (C#)
```csharp
public class MultiReferenceAnnotationType : ElementType
```

## Remarks
Multi-reference annotations can be used to label and dimension Rebar elements, and are labeled in the user interface as "Multi-rebar annotations".
 The type specifies the tag and dimension types to be used in the multi-reference annotation, as well as associated display settings.